// ************************************************************************ //
// 警告
// -------
// このファイルで宣言されている型はタイプ ライブラリから読み取られたデータから
// 生成されています。このタイプ ライブラリが明示的あるいは（このタイプ ライブラ
// リを参照しているほかのタイプ ライブラリ経由で）間接的に再インポートされた
// り、タイプ ライブライブラリの編集中にタイプ ライブラリ エディタの［更新］コマ
// ンドを実行した場合、このファイルの内容はすべて再生成され、手動で加えた変更
// はすべて失われます。
// ************************************************************************ //

// $Rev: 92848 $
// 下に説明されたタイプ ライブラリから 2020/12/01 11:48:12 に生成されたファイル。

// ************************************************************************  //
// タイプ ライブラリ: C:\Users\javac\misc5\c++builder\Project1\Project1 (1)
// LIBID: {AE49D51F-AFF3-41BA-9D66-C09D38754E77}
// LCID: 0
// ヘルプファイル:
// ヘルプ文字列:
// 依存関係リスト:
//   (1) v2.0 stdole, (C:\Windows\SysWOW64\stdole2.tlb)
// SYS_KIND: SYS_WIN32
// ************************************************************************ //

#include <vcl.h>
#pragma hdrstop

#include "Project1_TLB.h"

#if !defined(__PRAGMA_PACKAGE_SMART_INIT)
#define      __PRAGMA_PACKAGE_SMART_INIT
#pragma package(smart_init)
#endif

namespace Project1_tlb
{

// *********************************************************************//
// タイプ ライブラリで宣言された GUID
// *********************************************************************//
const GUID LIBID_Project1 = {0xAE49D51F, 0xAFF3, 0x41BA,{ 0x9D, 0x66, 0xC0,0x9D, 0x38, 0x75,0x4E, 0x77} };
const GUID CLSID_CoClass1 = {0xF664C712, 0xEC63, 0x4E2A,{ 0xB5, 0xD7, 0xEA,0x45, 0x32, 0x8E,0x89, 0xF4} };
const GUID DIID_DispInterface1 = {0xCF2B8A63, 0x94AC, 0x42CA,{ 0xB9, 0x62, 0xAC,0x2C, 0x9C, 0x06,0xF2, 0x52} };

};     // namespace Project1_tlb

